0.1.0/tutorials/incompressible/piso/les/pitz_daily/constant/turbulenceProperties
// mousse: CFD toolbox

FoamFile
{
  version     2.0;
  format      ascii;
  class       dictionary;
  location    "constant";
  object      turbulenceProperties;
}

simulationType  LES;
LES
{
  LESModel        dynamicKEqn;
  turbulence      on;
  printCoeffs     on;
  delta           cubeRootVol;
  dynamicKEqnCoeffs
  {
    filter simple;
  }
  cubeRootVolCoeffs
  {
    deltaCoeff      1;
  }
  PrandtlCoeffs
  {
    delta           cubeRootVol;
    cubeRootVolCoeffs
    {
      deltaCoeff      1;
    }
    smoothCoeffs
    {
      delta           cubeRootVol;
      cubeRootVolCoeffs
      {
        deltaCoeff      1;
      }
      maxDeltaRatio   1.1;
    }
    Cdelta          0.158;
  }
  vanDriestCoeffs
  {
    delta           cubeRootVol;
    cubeRootVolCoeffs
    {
      deltaCoeff      1;
    }
    smoothCoeffs
    {
      delta           cubeRootVol;
      cubeRootVolCoeffs
      {
        deltaCoeff      1;
      }
      maxDeltaRatio   1.1;
    }
    Aplus           26;
    Cdelta          0.158;
  }
  smoothCoeffs
  {
    delta           cubeRootVol;
    cubeRootVolCoeffs
    {
      deltaCoeff      1;
    }
    maxDeltaRatio   1.1;
  }
}

// vim: set ft=foam et sw=2 ts=2 sts=2:
